/* ==================================================================================

 File name:     systick.c
 Originator:    BLJ
 Description:   利用STM32内部专用tick定时器，实现一个快速时基，精度1us。内部专用定时器，
                中断处理模式，不建议使用。仍用PWM中断作为时基速度慢但更可靠

=====================================================================================
 History:
-------------------------------------------------------------------------------------
 11-24-2014     Version 1.0.0           初始版本，由例程修改整理得到
-----------------------------------------------------------------------------------*/

#include "stm32f10x.h"
#include "SYSTICK.h"

extern u16 nTime;           // 此变量在stm32f10x_it.c 中被定义

// ------------------------- SYSTICK初始化，1us中断1次 ------------------------------
void SYSTICK_Init(void)
{       
    while (SysTick_Config(SystemCoreClock/ 1000000));
}

// ---------------------------- 延时程序，精度1us ----------------------------
void delay_us(u16 nus)
{
    nTime = nus;
    while(nTime);
}

// ------------------ 精确延时程序，精度1us，最小延时时间1ms -----------------
void delay_ms(u16 nms)
{
    while(nms--)
    delay_us(1000);
}
